espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/gpio_ext_eco5_struct.h
/** Type of etm_task_p6_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio24_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio24_en:1;
        /** etm_task_gpio24_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio24_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio25_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio25_en:1;
        /** etm_task_gpio25_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio25_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio26_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio26_en:1;
        /** etm_task_gpio26_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio26_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio27_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio27_en:1;
        /** etm_task_gpio27_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio27_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p6_cfg_reg_t;

/** Type of etm_task_p7_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio28_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio28_en:1;
        /** etm_task_gpio28_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio28_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio29_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio29_en:1;
        /** etm_task_gpio29_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio29_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio30_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio30_en:1;
        /** etm_task_gpio30_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio30_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio31_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio31_en:1;
        /** etm_task_gpio31_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio31_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p7_cfg_reg_t;

/** Type of etm_task_p8_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio32_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio32_en:1;
        /** etm_task_gpio32_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio32_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio33_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio33_en:1;
        /** etm_task_gpio33_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio33_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio34_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio34_en:1;
        /** etm_task_gpio34_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio34_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio35_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio35_en:1;
        /** etm_task_gpio35_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio35_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p8_cfg_reg_t;

/** Type of etm_task_p9_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio36_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio36_en:1;
        /** etm_task_gpio36_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio36_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio37_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio37_en:1;
        /** etm_task_gpio37_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio37_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio38_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio38_en:1;
        /** etm_task_gpio38_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio38_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio39_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio39_en:1;
        /** etm_task_gpio39_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio39_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p9_cfg_reg_t;

/** Type of etm_task_p10_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio40_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio40_en:1;
        /** etm_task_gpio40_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio40_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio41_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio41_en:1;
        /** etm_task_gpio41_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio41_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio42_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio42_en:1;
        /** etm_task_gpio42_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio42_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio43_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio43_en:1;
        /** etm_task_gpio43_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio43_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p10_cfg_reg_t;

/** Type of etm_task_p11_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio44_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio44_en:1;
        /** etm_task_gpio44_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio44_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio45_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio45_en:1;
        /** etm_task_gpio45_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio45_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio46_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio46_en:1;
        /** etm_task_gpio46_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio46_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio47_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio47_en:1;
        /** etm_task_gpio47_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio47_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p11_cfg_reg_t;

/** Type of etm_task_p12_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio48_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio48_en:1;
        /** etm_task_gpio48_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio48_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio49_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio49_en:1;
        /** etm_task_gpio49_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio49_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio50_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio50_en:1;
        /** etm_task_gpio50_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio50_sel:3;
        uint32_t reserved_20:4;
        /** etm_task_gpio51_en : R/W; bitpos: [24]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio51_en:1;
        /** etm_task_gpio51_sel : R/W; bitpos: [27:25]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio51_sel:3;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_etm_task_p12_cfg_reg_t;

