espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/gpio_ext_eco5_struct.h
/** Type of etm_task_p13_cfg register
 *  Etm Configure Register to decide which GPIO been chosen
 */
typedef union {
    struct {
        /** etm_task_gpio52_en : R/W; bitpos: [0]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio52_en:1;
        /** etm_task_gpio52_sel : R/W; bitpos: [3:1]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio52_sel:3;
        uint32_t reserved_4:4;
        /** etm_task_gpio53_en : R/W; bitpos: [8]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio53_en:1;
        /** etm_task_gpio53_sel : R/W; bitpos: [11:9]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio53_sel:3;
        uint32_t reserved_12:4;
        /** etm_task_gpio54_en : R/W; bitpos: [16]; default: 0;
         *  Enable bit of GPIO response etm task.
         */
        uint32_t etm_task_gpio54_en:1;
        /** etm_task_gpio54_sel : R/W; bitpos: [19:17]; default: 0;
         *  GPIO choose a etm task channel.
         */
        uint32_t etm_task_gpio54_sel:3;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} gpiosd_etm_task_p13_cfg_reg_t;


/** Group: Version Register */
/** Type of version register
 *  Version Control Register
 */
typedef union {
    struct {
        /** gpio_sd_date : R/W; bitpos: [27:0]; default: 35663952;
         *  Version control register.
         */
        uint32_t gpio_sd_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpiosd_version_reg_t;


typedef struct {
    volatile gpiosd_sigmadeltan_reg_t sigmadeltan[8];
    uint32_t reserved_020;
    volatile gpiosd_sigmadelta_misc_reg_t sigmadelta_misc;
    uint32_t reserved_028[2];
    volatile gpiosd_glitch_filter_chn_reg_t glitch_filter_chn[8];
    uint32_t reserved_050[4];
    volatile gpiosd_etm_event_chn_cfg_reg_t etm_event_chn_cfg[8];
    uint32_t reserved_080[8];
    volatile gpiosd_etm_task_p0_cfg_reg_t etm_task_p0_cfg;
    volatile gpiosd_etm_task_p1_cfg_reg_t etm_task_p1_cfg;
    volatile gpiosd_etm_task_p2_cfg_reg_t etm_task_p2_cfg;
    volatile gpiosd_etm_task_p3_cfg_reg_t etm_task_p3_cfg;
    volatile gpiosd_etm_task_p4_cfg_reg_t etm_task_p4_cfg;
    volatile gpiosd_etm_task_p5_cfg_reg_t etm_task_p5_cfg;
    volatile gpiosd_etm_task_p6_cfg_reg_t etm_task_p6_cfg;
    volatile gpiosd_etm_task_p7_cfg_reg_t etm_task_p7_cfg;
    volatile gpiosd_etm_task_p8_cfg_reg_t etm_task_p8_cfg;
    volatile gpiosd_etm_task_p9_cfg_reg_t etm_task_p9_cfg;
    volatile gpiosd_etm_task_p10_cfg_reg_t etm_task_p10_cfg;
    volatile gpiosd_etm_task_p11_cfg_reg_t etm_task_p11_cfg;
    volatile gpiosd_etm_task_p12_cfg_reg_t etm_task_p12_cfg;
    volatile gpiosd_etm_task_p13_cfg_reg_t etm_task_p13_cfg;
    uint32_t reserved_0d8[9];
    volatile gpiosd_version_reg_t version;
} gpiosd_dev_t;

extern gpiosd_dev_t GPIO;

#ifndef __cplusplus
_Static_assert(sizeof(gpiosd_dev_t) == 0x100, "Invalid size of gpiosd_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
